{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"Dense","config":{"units":12,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.01}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true,"batch_input_shape":[null,11],"dtype":"float32"}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization1","trainable":true}},{"class_name":"Dense","config":{"units":2,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true}}]},"keras_version":"tfjs-layers 4.6.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.6.0","convertedBy":null,"weightsManifest":[{"paths":["./LogisticReg.weights.bin"],"weights":[{"name":"dense_Dense1/kernel","shape":[11,12],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[12],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/gamma","shape":[12],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/beta","shape":[12],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[12,2],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[2],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_mean","shape":[12],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_variance","shape":[12],"dtype":"float32"}]}]}